diplom-src/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВМК_ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВМК_ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВМК_СуммаАбоненскойПлаты</name>
    <type>
      <types>DefinedType.ВКМ_ТипСумма</types>
    </type>
  </attributes>
  <attributes>
    <name>ВМК_СтоимостьЧасаРаботы</name>
    <type>
      <types>DefinedType.ВКМ_ТипСумма</types>
    </type>
  </attributes>
</mdclass:Catalog>

diplom-src/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВМК_АбоненскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

diplom-src/src/Catalogs/ДоговорыКонтрагентов/Forms/ФормаЭлемента/Module.bsl
//Дауге 30012024++
#Область ОбработчикиСобытийФормы
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимостьЭлментовФормы();
КонецПроцедуры
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ДобавитьПолеВводаНаСервере();
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	УстановитьВидимостьЭлментовФормы();
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура УстановитьВидимостьЭлментовФормы()
	Если Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВМК_АбоненскоеОбслуживание Тогда
		Элементы.ГруппаШапка.Видимость = Истина;
	Иначе
		Элементы.ГруппаШапка.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры
&НаСервере
Процедура ДобавитьПолеВводаНаСервере()
	ГруппаШапка = Элементы.Добавить("ГруппаШапка", Тип("ГруппаФормы"), ЭтотОбъект);
	ГруппаШапка.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаШапка.Отображение = ОтображениеОбычнойГруппы.Нет;
	ГруппаШапка.Заголовок = "Дополнительные данные";
	ГруппаШапка.ОтображатьЗаголовок = Истина;
	ГруппаШапка.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;

	ГруппаДоговор = Элементы.Добавить("ГруппаДоговор", Тип("ГруппаФормы"), Элементы.ГруппаШапка);
	ГруппаДоговор.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаДоговор.Отображение = ОтображениеОбычнойГруппы.Нет;
	ГруппаДоговор.ОтображатьЗаголовок = Ложь;
	ГруппаДоговор.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;

	ГруппаСумма = Элементы.Добавить("ГруппаСумма", Тип("ГруппаФормы"), ГруппаШапка);
	ГруппаСумма.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаСумма.Отображение = ОтображениеОбычнойГруппы.Нет;
	ГруппаСумма.ОтображатьЗаголовок = Ложь;
	ГруппаСумма.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;

	ПолеВвода = Элементы.Добавить("ДатаНачала", Тип("ПолеФормы"), ГруппаДоговор);
	ПолеВвода.Заголовок = "Дата начала";
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ВМК_ДатаНачала";

	ПолеВвода = Элементы.Добавить("ДатаОкончания", Тип("ПолеФормы"), ГруппаДоговор);
	ПолеВвода.Заголовок = "Дата окончания";
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ВМК_ДатаОкончания";

	ПолеВвода = Элементы.Добавить("СуммаАбоненскойПлаты", Тип("ПолеФормы"), ГруппаСумма);
	ПолеВвода.Заголовок = "СуммаАбоненскойПлаты";
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ВМК_СуммаАбоненскойПлаты";

	ПолеВвода = Элементы.Добавить("СтоимостьЧасаРаботы", Тип("ПолеФормы"), ГруппаСумма);
	ПолеВвода.Заголовок = "СтоимостьЧасаРаботы";
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ВМК_СтоимостьЧасаРаботы";
КонецПроцедуры
#КонецОбласти
//Дауге 30012024--
